package com.ddf.boot.common.websocket.model.ws;


import java.io.Serializable;

/**
 * 客户端应用数据通道
 *
 * <p>
 * <p>
 * _ooOoo_
 * o8888888o
 * 88" . "88
 * (| -_- |)
 * O\ = /O
 * ___/`---'\____
 * .   ' \\| |// `.
 * / \\||| : |||// \
 * / _||||| -:- |||||- \
 * | | \\\ - /// | |
 * | \_| ''\---/'' | |
 * \ .-\__ `-` ___/-. /
 * ___`. .' /--.--\ `. . __
 * ."" '< `.___\_<|>_/___.' >'"".
 * | | : `- \`.;`\ _ /`;.`/ - ` : | |
 * \ \ `-. \_ __\ /__ _/ .-` / /
 * ======`-.____`-.___\_____/___.-`____.-'======
 * `=---='
 * .............................................
 * 佛曰：bug泛滥，我已瘫痪！
 * @author company
 */
public enum ClientChannel implements Serializable {

    /**
     * 客户端工具
     */
    PAY_MAIN,

    /**
     * 云闪付
     */
    UPAY,
    /**
     * 支付宝
     */
    ALIPAY,
    /**
     * 微信
     */
    WECHAT_PAY,
    /**
     * 工行app
     */
    ICBC_APP,
    /**
     * 建行app
     */
    CCB_APP;

}
